In [26]:
import pandas as pd 
df = pd.read_csv("cars.csv")

In [27]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [28]:
df.shape

(8128, 5)

In [29]:
df.describe()

          km_driven  selling_price
count  8.128000e+03   8.128000e+03
mean   6.981951e+04   6.382718e+05
std    5.655055e+04   8.062534e+05
min    1.000000e+00   2.999900e+04
25%    3.500000e+04   2.549990e+05
50%    6.000000e+04   4.500000e+05
75%    9.800000e+04   6.750000e+05
max    2.360457e+06   1.000000e+07

In [30]:
df.isnull().sum()

brand            0
km_driven        0
fuel             0
owner            0
selling_price    0
dtype: int64

In [31]:
df.duplicated().sum()

1678

In [32]:
df = df.drop_duplicates()

In [33]:
df.duplicated().sum()

0

In [34]:
df.shape

(6450, 5)

In [35]:
df1 = pd.get_dummies(df , columns= ['fuel','owner'])

In [37]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [38]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [40]:
x = df.iloc[:, :4]
y = df.iloc[:, -1:]
y

      selling_price
0            450000
1            370000
2            158000
3            225000
4            130000
...             ...
8121         260000
8122         475000
8123         320000
8124         135000
8125         382000

[6450 rows x 1 columns]

In [41]:
from sklearn.model_selection import train_test_split
x_train , x_test , y_train , y_test = train_test_split(x , y , test_size=0.2)

In [43]:
from sklearn.preprocessing import OneHotEncoder
import numpy as np
onehot = OneHotEncoder()
onehot = OneHotEncoder(drop='first',dtype=np.int32)
X_train_new = onehot.fit_transform(x_train[['fuel','owner']])
X_test_new = onehot.transform(x_test[['fuel','owner']])

In [48]:
print(X_train_new)

<Compressed Sparse Row sparse matrix of dtype 'int32'
	with 7137 stored elements and shape (5160, 7)>
  Coords	Values
  (0, 2)	1
  (1, 2)	1
  (2, 2)	1
  (2, 4)	1
  (3, 0)	1
  (3, 6)	1
  (4, 2)	1
  (5, 2)	1
  (5, 4)	1
  (6, 2)	1
  (6, 6)	1
  (7, 2)	1
  (8, 2)	1
  (9, 2)	1
  (10, 2)	1
  (11, 0)	1
  (11, 4)	1
  (12, 0)	1
  (13, 0)	1
  (14, 2)	1
  (15, 2)	1
  (15, 4)	1
  (16, 0)	1
  (16, 4)	1
  (17, 0)	1
  :	:
  (5142, 4)	1
  (5143, 2)	1
  (5144, 0)	1
  (5145, 2)	1
  (5146, 0)	1
  (5147, 2)	1
  (5148, 0)	1
  (5149, 0)	1
  (5149, 6)	1
  (5150, 0)	1
  (5151, 0)	1
  (5152, 0)	1
  (5152, 3)	1
  (5153, 2)	1
  (5154, 0)	1
  (5154, 4)	1
  (5155, 0)	1
  (5156, 0)	1
  (5156, 6)	1
  (5157, 0)	1
  (5157, 4)	1
  (5158, 2)	1
  (5158, 6)	1
  (5159, 0)	1
  (5159, 4)	1